{"pages":[{"title":"404","text":"","path":"404/index.html","date":"05-31","excerpt":""},{"title":"分类","text":"","path":"categories/index.html","date":"05-31","excerpt":""},{"title":"标签","text":"","path":"tags/index.html","date":"05-31","excerpt":""},{"title":"search","text":"","path":"search/index.html","date":"05-31","excerpt":""},{"title":"关于我","text":"","path":"about/index.html","date":"06-02","excerpt":""}],"posts":[{"title":"如果可以依靠，没有哪个女人愿意做女汉子","text":"一、两个人之间最好的感觉就是，表面相互嫌弃，心中不离不弃。 二、我们避而不谈的是真实的自己，怕被别人看穿，更是怕好不容易才伪装的自己被毁于一旦。 三、人生是很累的，你现在不累，以后就会更累。人生是很苦的，你现在不苦，以后就会更苦。唯累过，方得闲。唯苦过，方知甜。。。 四、相爱的时候需要真诚，争执的时候需要沟通， 生气的时候需要冷静，愉快的时候需要分享， 指责的时候需要谅解，爱情就是需要包容。 五、我善良，但不及天使；我有罪，却并非魔鬼。我是我，不容复制。 六、每一个懂事的淡定的现在，都有一个很傻很天真的过去；每一个温暖而淡然的如今，都有一个悲伤而不安的曾经。 七、如果可以依靠，没有哪个女人愿意做女汉子。所以不要说女人强势，只是你驾驭不了而已。 八、那些无法复制的浪漫，只能在回忆里慢慢变淡。 九、小时候，哭是我们解决问题的绝招。长大后，笑是我们面对现实的武器。 十、人生，就像乘坐一辆公交车，知道它有起点和终点，却无法预知沿途的经历。 十一、所谓门槛，过去了就是门，没过去就成了槛。把事情变复杂很简单，把事情变简单很复杂。 十二、最美好的事，是看到某人的微笑；而更美好的事，是他因你而微笑。 十三、人生最好的旅行，就是你在一个陌生的地方，发现一种久违的感动。独自旅行，不受羁绊，没有约束。有一天，背上包，带上自己，有多远，走多远。 十四、世界上最难断的是感情，最难求的是真情，最难猜的是心情，最痛苦的是自作多情。 十五、许多年过去了，人们说陈年旧事可以被埋葬，然而我终于明白这是错的，因为往事会自行爬上来。 十六、人生最奢侈的拥有是一颗不老的童心，一个生生不息的信念，一个健康的身体，一个永远牵手的爱人。 十七、不惊扰别人的宁静，就是慈悲；不伤害别人的自尊，就是善良。人活着，发自己的光就好，不要吹灭别人的灯。 十八、世界上哪有那么多的将心比心，你一味的付出不过是惯出来得寸进尺的人。过度考虑别人的感受，就注定自己不好受。 十九、生活，就是体谅和理解，把快乐装在心中，静静融化，慢慢扩散！ 二十、让你病的人，给不了你药；给你药的人，舍不得你病。 有切身体会的伤感说说：如果可以依靠，没有哪个女人愿意做女汉子 二十一、谁都不傻，总是敷衍，都会渐行渐远；谁也不笨，没被看重，都要越来越淡。 二十二、重要的人越来越少，但留下的人越来越重要。 二十三、总有一天你恍然大悟，父母是你花心思，花时间最少，却最爱你的人。 二十四、今天多学一点知识，明天就少一句求人的话。 二十五、一个人出生了，人们并不知道他的未来，却说恭喜恭喜。一个人死去了，人们并不知道死后世界，却说可惜可惜。 二十六、喜欢微笑，并不表示你现在过得很好，而是你知道，只有微笑，以后才会过得比现在要好。 二十七、总有做不完的事，吐不完的怨气，减不完的肥，这就是生活吧。 二十八、走过的路越多，越喜欢宅着；见过的人越多，越喜欢孩子。 二十九、如果不是相互喜欢，痴情就是别人的负担，其实你不必这么冷淡，我也没想过纠缠。 三十、与其违心赔笑，不如一人安静，与其在意别人的背弃和不善，不如经营自己的尊严和美好。 三十一、生活再不如人意，都要学会自我温暖和慰藉，给自己多一点欣赏和鼓励。 三十二、就算路不坦荡，也要做自己的太阳。 三十三、置身事外，谁都可以心平气和，身处其中，谁还可以淡定从容？所以请不要轻易评论任何人，因为你不在其中。 三十四、如果你真的愿意去努力，你人生最坏的结果，也不过是大器晚成。 三十五、生活本来就不易，不必事事渴求别人的理解和认同，静静的过自己的生活。心若不动，风又奈何。你若不伤，岁月无恙。 三十六、高兴也是一天，难过也是一天，何必给自己找麻烦呢？我其实宁可活得傻乎乎的，哪怕是装出来的，本来心里不高兴，装着装着，没准真的高兴了。 三十七、时间不仅让你看透别人，也让你认清自己。很多时候，就是在跌跌拌拌中，我们学会了生活。 三十八、总有那么一天你是会发现，我不是谁都可以替代。 三十九、忙是治疗一切神经病的良药，一忙，也不伤感了也不八卦了也不撕逼了也不花痴了。 四十、人类的存活就是适应，适应肮脏，适应死亡，适应背叛，适应流逝。","path":"article/854c6e21.html","date":"06-03","excerpt":"","tags":[{"name":"伤感","slug":"伤感","permalink":"http://blog.hacksafe.cc/tags/伤感/"}]},{"title":"520情人节搞笑语录","text":"1.一般长得好看的人都是单身的，例如我。 2.有一种单身，只是为了等待一个人，等那一个该等的人。 3.丑的人已经迫不及待地找人将就了，帅的人仍然坚持原则，继续单身。 4.什么520，明天521不也是我爱你么。522还是我爱二的发疯节。523我爱散分手节。524我爱死自杀节。525我爱我自恋节。526我爱溜逃课节。527我爱吃吃货节。528我爱扒赤膊节。529我爱酒酒醉节。只要生活有乐趣天天都过节！ 5.长得漂亮的都开始收520礼物了，我照了照镜子，放弃了。人分两种：一种好看的；一种难看的。我夹在中间，属于好难看的，我不相信520，也收不到礼物。我只相信502，一滴永固，三秒即可，永不分离。质量有保证502值得信赖！ 6.自从我妈知道单身狗这个词后，她已经忘了我叫什么名字 7.说好一起做单身狗，你们却偷偷交了男朋友 520情人节搞笑说说2019最新 一般长得好看的人都单身1 8.我单身是因为仙女不能和凡人谈恋爱，这样会触犯天条的 9.朋友问我情人节要怎么过，我淡淡的说了俩字“略过”。 10.本来想送你个超棒超可爱的情人节礼物，可是快递员不让我钻进去。 11.情人节了怕对象太帅被人抢走？换我，我丑。 12.情人节你们缺灯泡吗？坐着吃饭不说话超可爱的那种，特别是去高档餐厅的联系下我，我还可以帮拍照，我还很会P图。 13.单身久了，别说拧瓶盖了，消防栓我都能拧开 14.单身的女孩不要着急，也许上帝心里的想法是：我要给这个可爱的女孩留个特别的人 15.单身也许就是做自己眼中的英雄，别人眼中的女汉子 16.去年对自己说的情话，今年再告诉自己一遍：你是全世界最好看，性格不差，身体健康，凭什么不被喜欢，520，我爱你啊！ 17.你敢嫁，我就敢娶；你敢买房，我就敢还贷；你敢死心踏地，我就敢不离不弃；你敢白头到老，我就敢陪你一世举岸齐眉；你敢说你是我的一切，我就敢说你是我的全世界！ 18.今天是情人节，可和我又有何关系，从来都是没有情人的情人节。 520情人节搞笑说说2019最新 一般长得好看的人都单身2 19.情人节，我掐指一算，不出意外的话，和我半毛钱关系都没有。 20.情人节，祝天下的情侣都是失散多年的兄妹！ 21.我骂你是为了你好，你应该从中学到些什么，比如说自知之明。 22.其实单身并不可怕，可怕的是连一个喜欢的人都没有。 23.每个单身的人背后，都至少藏着一个让人心碎的秘密。 24.单身挺好，不吃醋，不流泪，不在乎，不怕离开，不怕失去，不怕被欺骗背叛，不怕自作多情。 25.大家都说我单身，真是搞笑，大家不都一样么，谁能有双身？就连哪吒三头六臂也只是一个身子！ 26.看我不顺眼的人，给你们心里添堵，我真是舒坦。 27.心里的一块石头终于落地了，可它竟然砸到我的脚！ 28.未来和我结婚的那位，情人节到了，少做点对不起我的事。 29.嘴上说着单身挺好,可是看到情侣,还是会沉默。 30.今天我和她分手了，柷我单身快乐吧。 31.优秀的人普遍单身 别问我为什么 优秀任性。 32.上帝是很公平的，他让你过了光棍节，就不会让你过情人节。","path":"article/b88d68aa.html","date":"06-03","excerpt":"","tags":[{"name":"搞笑","slug":"搞笑","permalink":"http://blog.hacksafe.cc/tags/搞笑/"}]},{"title":"拥有梦想只是一种智力，实现梦想才是一种能力","text":"一、你若不想做，会找一个或无数个借口；你若想做，会想一个或无数个办法。 二、即使弄得遍体鳞伤，也要自己活得漂亮。 三、擦干当年所有的泪，所有的痛，遗忘悲伤，重新来过。 四、忘记你曾经的那份承诺，一个人坚强的走完余生。 五、活着不是要用眼泪博得同情，而是用汗水赢得掌声。 六、每件事最后都会是好事。如果不是好事，说明还没到最后。 七、人生坎坎坷坷，跌跌撞撞那是在所难免。 八、自己要懂得心疼自己，因为是为自己而活。 九、没完没了的工作，就是为了明日复明日的生活。 十、忍是一种眼光，忍是一种胸怀，忍是一种领悟，忍是一种人生的技巧，忍是一种规则的智慧。 十一、我只拥有你的月光，我要把它当作骄阳。 十二、没有口水与汗水，就没有成功的泪水。 十三、聪明的男人在适当时候假装愚蠢，愚蠢的男人在任何时候都自作聪明。 十四、你如继续悲观，必定只会孤单。 十五、成长中不计后果的那段，叫做青春。 十六、人生就像赛跑，不在乎你是否第一个到达尽头，而在乎你有没有跑完全程。 十七、生命不在于活得长与短，而在于顿悟的早与晚。 十八、后悔过去，不如奋斗将来。 关于梦想的伤感语录说说：拥有梦想只是一种智力，实现梦想才是一种能力 十九、石头记告诉我们：凡是真的爱的最后都散了，凡是混搭的最后都团圆了。 二十、与其顾虑太多，倒不如放手一搏。 二十一、只要我们能梦想的，我们就能实现。 二十二、人不能盲目的去奋斗。要有目标。只有为自己目标奋斗才会得到你想要的收获。 二十三、永远不要对任何事感到后悔，因为它曾经一度就是你想要的。 二十四、如果刚烈是在哭泣中锻炼出来的，哪么让我哭个昏天暗地吧。 二十五、现代社会已不是大鱼吃小鱼的年代，而是快鱼吃慢鱼的年代。 二十六、微笑转身，用背影让故事完结。 二十七、一个女人成熟的标志，是学会狠心，学会独立，学会微笑，学会丢弃不值得的感情。 二十八、人生的旅途中，会有一段路需要自己走，一些事需要自己扛。扛得下你就赢。 二十九、在苦也要坚持，在累也要拼搏。 三十、不要让你的梦想是梦和想！ 三十一、不管雨下多久，最终彩虹总会出现。 三十二、走过这片泥泞，我在那里等你！ 三十三、如果你是捷达，却嵌入了捷豹的野心，那么这是自找罪受，但只要你喜欢，而且心甘情愿，哪怕你是捷安特都没关系。 三十四、奋斗就会有美好的未来。 三十五、麻烦没来找你，就别去自找麻烦。 三十六、人能走多远？这话不要问双脚，而是要问志向。 三十七、不要以为登上了顶峰，你就能征服全世界。 三十八、过去属于死神，未来属于你自己。 三十九、并不是每次失落都有原因。所以、累了就蹲下来抱抱自己。 四十、你什么时候放下，什么时候就没有烦恼。 四十一、拥有梦想只是一种智力，实现梦想才是一种能力。 四十二、别为了男人哭，那样对不起你的父母。 四十三、仍然在途中，只好相信雨過後有彩虹。 四十四、每一个成功者都有一个开始。勇于开始，才能找到成功。 四十五、身处低谷，怎么走都是向上。 四十六、梦想需要反思，但更需要坚持。 四十七、乌云的背后是阳光，阳光的背后是彩虹。 四十八、你现在难过的时候眼里流的泪，就是你原来浪的时候脑子进的水！ 四十九、生活坏到一定程度就会好起来的，因为它无法更坏。 五十、坚强的信心，能使平凡的人做出惊人的事业。 五十一、让别人快乐是慈悲，让自己快乐是智慧。 五十二、宁愿选择跌跌撞撞过一辈子，也不平平凡凡混一辈子。 五十三、两点之间未必直线最短，有时迂回曲折能够更快地抵达终点。 五十四、不经历风雨的孩子，永远也长不大！ 五十五、错了才懂的的道理没有人不懂，就是要你错之前懂得那才精彩。 五十六、生活中难免遭遇打击。但是，真正能把你击倒的是你的态度。 五十七、一个人，想要优秀，你必须要接受挑战。 五十八、人生应当欢乐有度；换一种活法也许更快乐。 五十九、只要面朝阳光，就会觉得很快乐。 六十、一路走来，风风雨雨，感慨却不后悔！ 六十一、叹气是最浪费时间的事情，哭泣是最浪费力气的行径。 六十二、人必须相信自己，这就是成功的秘诀。 六十三、最穷无非讨饭，不死终会出头。 六十四、看似坚强的人，内心越是脆弱。 六十五、学会适应，你就会让你的环境变的明亮。 六十六、人是靠向高处走，水是靠向低处流。 六十七、总想赢者必输，不怕输者必赢。 六十八、不了解一个人的过去，就没资格评判他的现在。 六十九、成功的信念在人脑中的作用就如闹钟，会在你需要时将你唤醒。 七十、闭着眼睛往前走、就会忘记后面发生不开心的事了。 七十一、命运，你残忍的诉说着我的悲痛。 七十二、自己选的路，别说爬了，就是死，你也得给我死在那条路上。 七十三、生活有时是令人沮丧的，但你可以努力让自己的过得开心。 七十四、回首之前走过的路，唯一值得庆幸的是，我从未循规蹈矩的行走。 七十五、做最好的今天，回顾最好的昨天，迎接最美好的明天。 七十六、每天早晨，敲醒自己的不是钟声，而是梦想。 七十七、华丽的结束，却可能是另一次传奇的开端。 七十八、谁都不必失落，适合自己的人生就是就是最好的人生。 七十九、人之所以平凡、在于难超越自己。耽搁你赶路的往往不是你脚下的坎儿、而是你鞋里的沙子。 八十、也许错过一瞬，就是错过一世。 八十一、赶脚的对头是脚懒，学习的对头是自满。 八十二、人生就像一杯茶，苦也只是一阵子，却不会苦一辈子。 八十三、付出多少，得到多少，这是一个众所周知的因果法则。 八十四、用这生命中的每一秒，给自己一个不后悔的未来。 八十五、决定你的人生高度的，不是你的才能，而是你的人生态度！ 八十六、前面的路还很远，你可能会哭，但是一定要走下去，一定不能停。 八十七、请用今天的努力让明天没有遗憾。 八十八、三言两语，安慰自己，冷言冷语，坚持自己！ 八十九、如果你不努力争取你想要的，那你永远都不会拥有它。 九十、不怕万人阻挡在前方，只怕自己先行投降。 九十一、早晨给自己一个微笑，种下一天旳阳光。 九十二、宁愿跑起来被拌倒无数次，也不愿规规矩矩走一辈子，就算跌倒也要豪迈的笑。 九十三、梦就算遥不可及，但只要坚持，一定会有实现的一天。 九十四、其实一个人也很好，可以哭可以笑可以没烦恼，可以吵可以闹也不要依靠。 九十五、有时候，上天没有给你想要的，不是因为你不配，而是你值得拥有更好的。 九十六、不管梦想是什么，只有带着淡然的态度，做好当前的事情。 九十七、心里的话，说出来可能是诗，可能是史，也可能是誓，但是留在肚子里肯定会变成屎。 九十八、踏进社会你要懂，你从此什么都会拥有，但拥有不了一个稳定的将来。 九十九、生活就是一种态度，倒霉也是一种另类人生。 一百、即使没有风，我也可以飞舞。即使逆着别人的方向，我也可以前进。 一百零一、没有一种不通过蔑视，忍受和奋斗就可以征服的命运。 一百零二、我现在虽然没到达终点，但至少比昨天更接近终点了。 一百零三、自己爱自己最美好，活着又不是给别人看的！ 一百零四、不要祈求别人遭遇灾难，最好的方法就是不断自我超越。 一百零五、不要嘲笑别人的疤，那只是你没有经历过的伤。 一百零六、没有爱不会死，不过有了爱会活过来。 一百零七、没有目标的人，努力有什么用。 一百零八、创造一种生活方式，而不只是一个企业。地基可以有多深。 一百零九、成功失败无所谓，拍拍灰只要你还知道自己是谁。 一百十、我们有什么好怕的，我们来到这个世上，就没打算活着回去！","path":"article/553f008e.html","date":"06-03","excerpt":"","tags":[{"name":"伤感","slug":"伤感","permalink":"http://blog.hacksafe.cc/tags/伤感/"}]},{"title":"2019最新唯美的语录","text":"一、高尚不是那种单纯的美好，而是对一切事物理解之后的超然，对善与恶一视同仁，用同情的目光看待世界。 二、生命中有一种爱，有一种懂你，是安静的，是无求的。 三、上善若水：做人如水，你高，我便退去，决不淹没你的优长；你低，我便涌来，决不暴露你的缺陷；你动，我便随行，决不撇下你的孤单；你静，我便长守，决不打扰你的安宁；你热，我便沸腾，决不妨碍你的热情；你冷，我便凝固，决不漠视你的寒冷。上善若水，从善如流，如水人生，随缘从众。 四、当时的他是最好的他，后来的我是最好的我。可是最好的我们之间，隔了一整个青春。怎么奔跑也跨不过的青春，只好伸出手道别。 五、时间是最好的偏方，无论有什么样的记忆，时间都会把回忆里的泪水风干。 六、淡泊寡欲可以养神，宁静致远可以养志，怡情适性可以养和，观空自在可以养心。 七、心若向阳，何惧忧伤。 八、是平凡，是平淡，是平衡。有棱角的坏处，就是让别人咬起你来很容易下口。 九、曾以为世界上最糟糕的事，就是孤独终老。其实不是。最糟糕的是与那些让你感到孤独的人一起终老。 十、如果你早认清你在別人心中沒那么重要，你会快乐很多。 十一、世间本无如来，心中有则有心中无则无。一花一天堂，一草一世界；一树一菩提，一土一如来；一方一净土，一笑一尘缘；一念一清净，心是莲花开。佛，无处有，佛，又无处不在。心中若有美，处处莲花开。水不洗水，尘不染尘。 十二、我们在人生中会作出许多选择，带着这些选择继续生活，才是人生中最难的一课。 十三、试着不要让别人同情你，别人也就不会知道怎么伤害你，要知道没有人走过和你一样的路，没有人和你看过完全一样的风景，所以要勇敢的前行！ 十四、利不可赚尽，福不可享尽，势不可用尽。给自己留有余地且不断尽他人后路。 十五、地球是运动的，一个人不可能永远处在倒霉的位置！你别看我今天裤穿窿，终有一日龙穿凤！风水轮流转，宁欺白须公，莫欺少年穷！ 十六、学历代表过去，学习能力才代表将来。 十七、当有一日，我们经历了被伤害，懂得了疼痛和畏惧，才会明白仁慈和退让。可这时，属于青春的飞扬和放肆也正逐渐离我们而去。我们长大了，胸腔里是一颗已经斑驳的心。 十八、心若亲近，言行必如流水般自然；心若疏远，言行只如三秋之树般萧瑟。不怕身隔天涯，只怕心在南北！ 十九、成功人生里的七种境界：百折不挠聚气生财包容接纳以柔克刚能屈能伸周济天下功成身退。 二十、难过时吃一粒糖，告诉自己生活是甜的。 二十一、能够说出的委屈便不算委屈，能够抢走的爱人便不算爱人。不说出委屈就只能委屈自己；不放走不爱你的人就得不到你爱的人。 二十二、不要过份在意一些人，如果有人问起，就说忘了。不解释，不悲伤。 二十三、命运偶尔会留意到你，发现你太过安逸，他觉得这样会毁了你，于是帮你改变。 二十四、听话的乖女儿不一定幸福，不争吵的婚姻不一定美满，稳定的好工作不一定开心，不流泪的日子不一定快乐。 二十五、人生不过是一场旅行，你路过我，我路过你，然后各自向前，各自修行。 二十六、多数的错与失，是因为不努力，不坚持，不挽留。然后告诉自己一切都是命运。 二十七、一辈子是场修行，短的是旅行，长的是人生。 二十八、比起那些你追了很久却没能在一起的，更可恨的是那些借爱之名闯进你的生活，在你准备适应他的存在接受他的围绕时，却露出原本面貌的人。不要因为习惯一个人而无条件地退让，也不要因为害怕回到一个人而不快乐的继续。学会聪明的告别，不值得为了错的人，坏了自己对爱的信心。 二十九、告诉自己，没有人比你更美好，因为这个世界上不会有第二个一模一样的你自己了。所以，爱自己才能让别人爱你！ 三十、做一个向日葵族，面对阳光，不自艾自怜，每天活出最灿烂的自己。 三十一、再黑的夜有人陪，也不觉困苦；再冷的冬有人想，也不会孤独。 三十二、成功者之所以能取得成就，就在于他们能做别人不愿做的事，做别人做不到的事。 三十三、我们总是在不懂爱情的年纪，遇上最美好的爱情。 三十四、知道为什么说相见不如怀念么？那是因为相见只能让人在现实面前无奈的哀悼伤痛，而怀念却可以把已经注定的谎言变成曾经美好的童话。 三十五、直到遇见了很多人，看到过很多事，才知道自己的那点忧伤多么微不足道，每个人的生活都有过千疮百孔，从千疮百孔到平凡努力的精彩，这就是最好的了不起。改变世界不用大刀阔斧，一个个小碎步依然可以光芒万丈。 三十六、世界上最远的距离，不是爱，不是恨，而是熟悉的人，渐渐变得陌生。 三十七、很多付出，可能永远都没有回报，但依旧乐意全情付出，是要为了给自己内心一个交代。 三十八、有的人对你好，是因为你对他好；有的人对你好，是因为懂得你的好。 三十九、美好的日子给你带来快乐，阴暗的日子给你带来经验。不要对生命中的任何一天怀有遗憾。 四十、嫉妒是很多人携带的臭毛病，除了尖酸刻薄，至少到目前为止，我还真没发现嫉妒能够对身心带来怎样的好处，最显着的体现是仇视做官的，仇视有钱的，真的没必要这样子，首先先问一下自己，假如自己某天做官了会怎样，有钱了会怎样。看看尘世中多少人在不分青红皂白的对当官有钱人理论纷纷，就能看出有多少人活的很糊涂。真有本事，也让自己做大官，做富豪，但是你要想想，你有那个德行吗？但愿到时候，你可以用良知和权力和实力去拯救身边更多需要帮助的人。 四十一、这世界的尴尬在于，不是每个人都处于你的素质水平，你礼让别人推推搡搡，你谦卑别人趾高气扬，你忍气吞声别人扯鼻子上脸，你打扮的花枝招展风度翩翩别人一胳膊肘就把你打下地铁让你狼狈不堪。素质不能来要求别人，只能来约束自己，所以委身世俗提醒自己保持点孤傲，挤身江湖提醒自己不放弃清高。 四十二、静静的过自己的生活，心若不动，风又奈何。你若不伤，岁月无恙。 四十三、高度的判断不在于事野，而在于心态；距离的判断不再于长度，而在于行动！ 四十四、多少人以友谊的名义，爱着一个人，认为拥有，其实是失去的开始。 四十五、你不懂我的沉默，又怎么会懂我的难过。 2019最新唯美的句子（61条） 四十六、成功和失败有时候只差那么一点点。那就要看你是不是有勇气并愿意做别人不要做的事情。有些人虔诚地做着成功的美丽的梦，而不愿从一点一滴做起，于是他最终除了梦想一无所有；而有些人却愿做别人不愿做的事，并最终取得成功。 四十七、人心有真假，时间能见证；感情有冷暖，风雨能考验。岁月，留不住虚幻的拥有。体会到缘分善变；平淡无语，感受了人情冷暖。有心的人，不管你在与不在，都会惦念；无心的情，无论你好与不好，只是漠然。走过一段路，总能有一次领悟；经历一些事，才能看清一些人在她（他）心里你是什么位置。 四十八、有些人即使在认识数年之后都是陌生的，彼此之间总似有一种隔膜存在，仿佛盛开在彼岸的花朵，遥遥相对，不可触及。而有些人在出场的一瞬间就是靠近的，仿佛散失之后再次辨认。那种近，有着温暖真实的质感。 四十九、最大的秘密，有时候，只能跟陌生人说。 五十、两个人在一起久了，就像左手和右手，即使不再相爱也会选择相守，因为放弃这么多年的感情需要很大的勇气。也许生命中会出现你爱的人，但最终你还是会牵着你的左手或右手一直走下去……“ 执子之手，与子偕老 ”。当初是誓言，后来是责任，再后来是习惯。 五十一、总得把旧的人请出去，才能让新的人住进来。不要再留在那里了，毫无意义，该走的人注定会走，该留的人打死也 不会走！ 五十二、上帝遣送绝望给我们，不是为了杀死我们，而是为了唤醒我们内心的新生命。如果一个人顺从命运默默承受自己的苦难，却不能将这苦难转化成新生的源泉，那这种苦难就是毫无价值的。 五十三、不管，你有多么真诚，遇到怀疑你的人，你就是谎言。不管，你有多么单纯，遇到复杂的人，你就是有心计。不管，你有多么的天真，遇到现实的人，你就是笑话。不管，你多么专业，遇到不懂的人，你就是空白。所以，不要太在乎别人对你的评价，你需要的只是，做最好的自己。 五十四、闭上眼睛，清理你的心，过去的就让它过去吧，用心甘情愿的态度，过随遇而安的生活。 五十五、享受每一刻的感觉，欣赏每一处的风景，这就是人生。 五十六、淡看人间事，潇洒天地间。再幸福的人生也有缺憾，再凄凉的人生都有幸福。潇洒的人生，要学会淡看缺憾，随缘而动。所谓随缘，就是尽人事而听天命。有随缘的心态，才能看淡失去，而把精力放到你可能的拥有上。失去变淡了，痛苦就轻了；拥有看重了，快乐就增值了。潇洒的人生，心里只愿装着喜乐。 五十七、前面的路还很远，你可能会哭，但是一定要走下去，一定不能停。 五十八、爱人与被爱都是幸福的，寸寸生命都有意义。人生下来个个都是戏子，非得有个基本观众不可，所以要恋爱。 五十九、我们所有的等待，不过是为了遇见这样一个对的人。只要是对的他，来得慢点也没关系。 六十、若是有缘，时间空间都不是距离；若是无缘，终日相聚也无法会意。 六十一、你没那么多观众，别那么累。做一个简单的人，踏实而务实。不沉溺幻想，更不庸人自扰","path":"article/e9ae0e7b.html","date":"06-03","excerpt":"","tags":[{"name":"优美","slug":"优美","permalink":"http://blog.hacksafe.cc/tags/优美/"}]},{"title":"人生是很累的，你现在不累，以后就会更累","text":"一、两个人之间最好的感觉就是，表面相互嫌弃，心中不离不弃。 二、我们避而不谈的是真实的自己，怕被别人看穿，更是怕好不容易才伪装的自己被毁于一旦。 三、人生是很累的，你现在不累，以后就会更累。人生是很苦的，你现在不苦，以后就会更苦。唯累过，方得闲。唯苦过，方知甜。。。 四、相爱的时候需要真诚，争执的时候需要沟通， 生气的时候需要冷静，愉快的时候需要分享， 指责的时候需要谅解，爱情就是需要包容。 五、我善良，但不及天使；我有罪，却并非魔鬼。我是我，不容复制。 六、每一个懂事的淡定的现在，都有一个很傻很天真的过去；每一个温暖而淡然的如今，都有一个悲伤而不安的曾经。 七、如果可以依靠，没有哪个女人愿意做女汉子。所以不要说女人强势，只是你驾驭不了而已。 八、那些无法复制的浪漫，只能在回忆里慢慢变淡。 九、小时候，哭是我们解决问题的绝招。长大后，笑是我们面对现实的武器。 十、人生，就像乘坐一辆公交车，知道它有起点和终点，却无法预知沿途的经历。 十一、所谓门槛，过去了就是门，没过去就成了槛。把事情变复杂很简单，把事情变简单很复杂。 十二、最美好的事，是看到某人的微笑；而更美好的事，是他因你而微笑。 十三、人生最好的旅行，就是你在一个陌生的地方，发现一种久违的感动。独自旅行，不受羁绊，没有约束。有一天，背上包，带上自己，有多远，走多远。 十四、世界上最难断的是感情，最难求的是真情，最难猜的是心情，最痛苦的是自作多情。 十五、许多年过去了，人们说陈年旧事可以被埋葬，然而我终于明白这是错的，因为往事会自行爬上来。 十六、人生最奢侈的拥有是一颗不老的童心，一个生生不息的信念，一个健康的身体，一个永远牵手的爱人。 十七、不惊扰别人的宁静，就是慈悲；不伤害别人的自尊，就是善良。人活着，发自己的光就好，不要吹灭别人的灯。 十八、世界上哪有那么多的将心比心，你一味的付出不过是惯出来得寸进尺的人。过度考虑别人的感受，就注定自己不好受。 十九、生活，就是体谅和理解，把快乐装在心中，静静融化，慢慢扩散！ 二十、让你病的人，给不了你药；给你药的人，舍不得你病。 有切身体会的伤感说说：如果可以依靠，没有哪个女人愿意做女汉子 二十一、谁都不傻，总是敷衍，都会渐行渐远；谁也不笨，没被看重，都要越来越淡。 二十二、重要的人越来越少，但留下的人越来越重要。 二十三、总有一天你恍然大悟，父母是你花心思，花时间最少，却最爱你的人。 二十四、今天多学一点知识，明天就少一句求人的话。 二十五、一个人出生了，人们并不知道他的未来，却说恭喜恭喜。一个人死去了，人们并不知道死后世界，却说可惜可惜。 二十六、喜欢微笑，并不表示你现在过得很好，而是你知道，只有微笑，以后才会过得比现在要好。 二十七、总有做不完的事，吐不完的怨气，减不完的肥，这就是生活吧。 二十八、走过的路越多，越喜欢宅着；见过的人越多，越喜欢孩子。 二十九、如果不是相互喜欢，痴情就是别人的负担，其实你不必这么冷淡，我也没想过纠缠。 三十、与其违心赔笑，不如一人安静，与其在意别人的背弃和不善，不如经营自己的尊严和美好。 三十一、生活再不如人意，都要学会自我温暖和慰藉，给自己多一点欣赏和鼓励。 三十二、就算路不坦荡，也要做自己的太阳。 三十三、置身事外，谁都可以心平气和，身处其中，谁还可以淡定从容？所以请不要轻易评论任何人，因为你不在其中。 三十四、如果你真的愿意去努力，你人生最坏的结果，也不过是大器晚成。 三十五、生活本来就不易，不必事事渴求别人的理解和认同，静静的过自己的生活。心若不动，风又奈何。你若不伤，岁月无恙。 三十六、高兴也是一天，难过也是一天，何必给自己找麻烦呢？我其实宁可活得傻乎乎的，哪怕是装出来的，本来心里不高兴，装着装着，没准真的高兴了。 三十七、时间不仅让你看透别人，也让你认清自己。很多时候，就是在跌跌拌拌中，我们学会了生活。 三十八、总有那么一天你是会发现，我不是谁都可以替代。 三十九、忙是治疗一切神经病的良药，一忙，也不伤感了也不八卦了也不撕逼了也不花痴了。 四十、人类的存活就是适应，适应肮脏，适应死亡，适应背叛，适应流逝。","path":"article/341ed379.html","date":"06-03","excerpt":"","tags":[{"name":"伤感","slug":"伤感","permalink":"http://blog.hacksafe.cc/tags/伤感/"}]},{"title":"什么是404页面","text":"什么是404错误页面：告诉浏览者其所请求的页面不存在或链接错误，同时引导用户使用网站其他页面而不是关闭窗口离开。 产生404错误页面原因： 1.网页URL生成规则改变。 2.网页文件更名或移动位置。 3.导入链接拼写错误。 注：以上3个为常见原因，从而导致原来的URL地址无法访问；当Web 服务器接到类似请求时，会返回一个404 状态码，告诉浏览器要请求的资源并不存在。 一、404错误页面对SEO的影响 1、重要程度自定义404错误页面是增强用户体验的很好的做法，但在应用过程中往往并未注意到对搜索引擎的影响，譬如：错误的服务器端配置导致返回“200”状态码或自定义404错误页面使用Meta Refresh导致返回“302”状态码。正确设置的自定义404错误页面，不仅应当能够正确地显示，同时，应该返回“404”错误代码，而不是 “200”或“302”。虽然对访问的用户而言，HTTP状态码究竟是“404”还是“200”来说并没有什么区别，但对搜索引擎这则是相当重要的。 2、惩罚程度搜索引擎蜘蛛在请求某个URL时得到“404”状态回应时，即知道该URL已经失效，便不再索引该网页，并向数据中心反馈将该URL表示的网页从索引数据库中删除，当然，删除过程有可能需要很长时间；而当搜索引擎得到“200”状态码时，则会认为该url是有效的，便会去索引，并会将其收录到索引数据库，这样的结果便是这两个不同的url具有完全相同的内容：自定义404错误页面的内容，这会导致出现复制网页问题。轻则被搜索引擎降权，重则会K掉网站。 二、404错误页面解决办法 1.把缺少的网页文件恢复到正确的位置，重新设置网络服务。 2.对于用户来讲，需要检查你所输入的网络地址是否正确。三、设置404错误页面的方法 1.对于存在的网页内容由于路径改变而导致访问不了时，可在IIS 中定义404错误指向一个动态页面，在页面里面使用301永久重定向跳转到新的地址，此时服务器返回301状态码。 2.设置404指向一个设计好的html 文件，此时页面返回的404状态码。 现在的idc提供商基本都提供404设置的功能，直接上传文件设置即可。在IIs中设置方法：打开IIS管理器–&gt;点击要设置自定义404的网站的属性–&gt;点击自定义错误选项–&gt;选中404页–&gt;选中并打开编辑属性–&gt;设置成 URL –&gt; URL 里填写“/err404.html”–&gt;按确定退出再把做好的err404.html 页面上传到网站根目录下。此处在“消息类型”中一定要选择“文件”或“默认值”，而不要选择“URL”，不然，将导致返回“200”状态码。3.404指向一个动态页面，比如error.asp,如果不在页面里面进行设置，仅仅是返回提示的HTML 代码，将导致页面返回200 状态码，这是不正确的，我们可以在显示完提示内容后，增加语句： Response.Status=”404 Not Found” ，这样就保证页面返回404状态码。4、Apache下设置404错误页面。为Apache Server设置404错误页面的方法很简单，只需在.htaccess 文件中加入如下内容即可，ErrorDocument 404 /notfound.php。 四、如何制作404错误页面： 1、Apache下设置404 (1)在.htaccess 文件中加入如下内容：ErrorDocument 404 /notfound.php，将.htaccess文件上传到网站根目录。 (2)制作一个404页面，随便您设计，命名为notfound.php，同样上传到网站根目录。 2、IIS/.net设置404 首先，修改应用程序根目录的设置，打开 web.config文件编辑，在其中加入如下内容： 注：上文例中error.asp为系统默认的404页面，notfound.asp为自定义的404页面，使用时请修改相应文件名。然后，在自定义的404页面notfound.asp中加入：&lt;% found=”” not=”” response.status=”404”&gt; 。这样，便可以保证IIS能够正确地返回404状态码。 &lt;% found=”” not=”” response.status=”404”&gt; 五、制作设置404错误页面注意事项 1.不要将404错误页面转向到网站主页，否则可能会导致主页在搜索引擎中消失。 2.不要使用绝对URL，如果使用绝对URL返回的状态码是302+200。 3.404错误页面设置完成，一定要检查是否正确。但http头信息返回的一定要是404状态。这主要是对搜索引擎有关系，因为如果你网站产生较多页面时候但搜索引擎看到的是很多一样的正常页面，有可能会误被认为作弊。 4.404错误页面不要自动跳转，让用户来决定去向，对于用户体验很重要。 总结：404错误页面建议1.不使用专业术语。2.不要责备访客。3.提示访客检查拼写。4.让页面返回404。5.明确表明404。6.帮助访客如果浏览。7.放置网站主页链接。8.访客方便反馈信息。9.保持品牌风格。10.让访客搜索想要的。11.修复你的错误链接。12.不要301重定向到主页。","path":"article/0.html","date":"06-03","excerpt":"","tags":[]},{"title":"庆祝绿帽的个人博客","text":"其实这是第一篇文章也没什么要说的呢","path":"article/538b512a.html","date":"06-02","excerpt":"","tags":[]}]}