{"pages":[{"title":"404","text":"","path":"404/index.html","date":"05-31","excerpt":""},{"title":"关于我","text":"","path":"about/index.html","date":"06-02","excerpt":""},{"title":"分类","text":"","path":"categories/index.html","date":"05-31","excerpt":""},{"title":"search","text":"","path":"search/index.html","date":"05-31","excerpt":""},{"title":"标签","text":"","path":"tags/index.html","date":"05-31","excerpt":""}],"posts":[{"title":"人生是很累的，你现在不累，以后就会更累","text":"一、两个人之间最好的感觉就是，表面相互嫌弃，心中不离不弃。 二、我们避而不谈的是真实的自己，怕被别人看穿，更是怕好不容易才伪装的自己被毁于一旦。 三、人生是很累的，你现在不累，以后就会更累。人生是很苦的，你现在不苦，以后就会更苦。唯累过，方得闲。唯苦过，方知甜。。。 四、相爱的时候需要真诚，争执的时候需要沟通， 生气的时候需要冷静，愉快的时候需要分享， 指责的时候需要谅解，爱情就是需要包容。 五、我善良，但不及天使；我有罪，却并非魔鬼。我是我，不容复制。 六、每一个懂事的淡定的现在，都有一个很傻很天真的过去；每一个温暖而淡然的如今，都有一个悲伤而不安的曾经。 七、如果可以依靠，没有哪个女人愿意做女汉子。所以不要说女人强势，只是你驾驭不了而已。 八、那些无法复制的浪漫，只能在回忆里慢慢变淡。 九、小时候，哭是我们解决问题的绝招。长大后，笑是我们面对现实的武器。 十、人生，就像乘坐一辆公交车，知道它有起点和终点，却无法预知沿途的经历。 十一、所谓门槛，过去了就是门，没过去就成了槛。把事情变复杂很简单，把事情变简单很复杂。 十二、最美好的事，是看到某人的微笑；而更美好的事，是他因你而微笑。 十三、人生最好的旅行，就是你在一个陌生的地方，发现一种久违的感动。独自旅行，不受羁绊，没有约束。有一天，背上包，带上自己，有多远，走多远。 十四、世界上最难断的是感情，最难求的是真情，最难猜的是心情，最痛苦的是自作多情。 十五、许多年过去了，人们说陈年旧事可以被埋葬，然而我终于明白这是错的，因为往事会自行爬上来。 十六、人生最奢侈的拥有是一颗不老的童心，一个生生不息的信念，一个健康的身体，一个永远牵手的爱人。 十七、不惊扰别人的宁静，就是慈悲；不伤害别人的自尊，就是善良。人活着，发自己的光就好，不要吹灭别人的灯。 十八、世界上哪有那么多的将心比心，你一味的付出不过是惯出来得寸进尺的人。过度考虑别人的感受，就注定自己不好受。 十九、生活，就是体谅和理解，把快乐装在心中，静静融化，慢慢扩散！ 二十、让你病的人，给不了你药；给你药的人，舍不得你病。 有切身体会的伤感说说：如果可以依靠，没有哪个女人愿意做女汉子 二十一、谁都不傻，总是敷衍，都会渐行渐远；谁也不笨，没被看重，都要越来越淡。 二十二、重要的人越来越少，但留下的人越来越重要。 二十三、总有一天你恍然大悟，父母是你花心思，花时间最少，却最爱你的人。 二十四、今天多学一点知识，明天就少一句求人的话。 二十五、一个人出生了，人们并不知道他的未来，却说恭喜恭喜。一个人死去了，人们并不知道死后世界，却说可惜可惜。 二十六、喜欢微笑，并不表示你现在过得很好，而是你知道，只有微笑，以后才会过得比现在要好。 二十七、总有做不完的事，吐不完的怨气，减不完的肥，这就是生活吧。 二十八、走过的路越多，越喜欢宅着；见过的人越多，越喜欢孩子。 二十九、如果不是相互喜欢，痴情就是别人的负担，其实你不必这么冷淡，我也没想过纠缠。 三十、与其违心赔笑，不如一人安静，与其在意别人的背弃和不善，不如经营自己的尊严和美好。 三十一、生活再不如人意，都要学会自我温暖和慰藉，给自己多一点欣赏和鼓励。 三十二、就算路不坦荡，也要做自己的太阳。 三十三、置身事外，谁都可以心平气和，身处其中，谁还可以淡定从容？所以请不要轻易评论任何人，因为你不在其中。 三十四、如果你真的愿意去努力，你人生最坏的结果，也不过是大器晚成。 三十五、生活本来就不易，不必事事渴求别人的理解和认同，静静的过自己的生活。心若不动，风又奈何。你若不伤，岁月无恙。 三十六、高兴也是一天，难过也是一天，何必给自己找麻烦呢？我其实宁可活得傻乎乎的，哪怕是装出来的，本来心里不高兴，装着装着，没准真的高兴了。 三十七、时间不仅让你看透别人，也让你认清自己。很多时候，就是在跌跌拌拌中，我们学会了生活。 三十八、总有那么一天你是会发现，我不是谁都可以替代。 三十九、忙是治疗一切神经病的良药，一忙，也不伤感了也不八卦了也不撕逼了也不花痴了。 四十、人类的存活就是适应，适应肮脏，适应死亡，适应背叛，适应流逝。","path":"article/341ed379.html","date":"06-03","excerpt":"","tags":[{"name":"伤感","slug":"伤感","permalink":"http://blog.hacksafe.cc/tags/伤感/"}]},{"title":"什么是404页面","text":"什么是404错误页面：告诉浏览者其所请求的页面不存在或链接错误，同时引导用户使用网站其他页面而不是关闭窗口离开。 产生404错误页面原因： 1.网页URL生成规则改变。 2.网页文件更名或移动位置。 3.导入链接拼写错误。 注：以上3个为常见原因，从而导致原来的URL地址无法访问；当Web 服务器接到类似请求时，会返回一个404 状态码，告诉浏览器要请求的资源并不存在。 一、404错误页面对SEO的影响 1、重要程度自定义404错误页面是增强用户体验的很好的做法，但在应用过程中往往并未注意到对搜索引擎的影响，譬如：错误的服务器端配置导致返回“200”状态码或自定义404错误页面使用Meta Refresh导致返回“302”状态码。正确设置的自定义404错误页面，不仅应当能够正确地显示，同时，应该返回“404”错误代码，而不是 “200”或“302”。虽然对访问的用户而言，HTTP状态码究竟是“404”还是“200”来说并没有什么区别，但对搜索引擎这则是相当重要的。 2、惩罚程度搜索引擎蜘蛛在请求某个URL时得到“404”状态回应时，即知道该URL已经失效，便不再索引该网页，并向数据中心反馈将该URL表示的网页从索引数据库中删除，当然，删除过程有可能需要很长时间；而当搜索引擎得到“200”状态码时，则会认为该url是有效的，便会去索引，并会将其收录到索引数据库，这样的结果便是这两个不同的url具有完全相同的内容：自定义404错误页面的内容，这会导致出现复制网页问题。轻则被搜索引擎降权，重则会K掉网站。 二、404错误页面解决办法 1.把缺少的网页文件恢复到正确的位置，重新设置网络服务。 2.对于用户来讲，需要检查你所输入的网络地址是否正确。三、设置404错误页面的方法 1.对于存在的网页内容由于路径改变而导致访问不了时，可在IIS 中定义404错误指向一个动态页面，在页面里面使用301永久重定向跳转到新的地址，此时服务器返回301状态码。 2.设置404指向一个设计好的html 文件，此时页面返回的404状态码。 现在的idc提供商基本都提供404设置的功能，直接上传文件设置即可。在IIs中设置方法：打开IIS管理器–&gt;点击要设置自定义404的网站的属性–&gt;点击自定义错误选项–&gt;选中404页–&gt;选中并打开编辑属性–&gt;设置成 URL –&gt; URL 里填写“/err404.html”–&gt;按确定退出再把做好的err404.html 页面上传到网站根目录下。此处在“消息类型”中一定要选择“文件”或“默认值”，而不要选择“URL”，不然，将导致返回“200”状态码。3.404指向一个动态页面，比如error.asp,如果不在页面里面进行设置，仅仅是返回提示的HTML 代码，将导致页面返回200 状态码，这是不正确的，我们可以在显示完提示内容后，增加语句： Response.Status=”404 Not Found” ，这样就保证页面返回404状态码。4、Apache下设置404错误页面。为Apache Server设置404错误页面的方法很简单，只需在.htaccess 文件中加入如下内容即可，ErrorDocument 404 /notfound.php。 四、如何制作404错误页面： 1、Apache下设置404 (1)在.htaccess 文件中加入如下内容：ErrorDocument 404 /notfound.php，将.htaccess文件上传到网站根目录。 (2)制作一个404页面，随便您设计，命名为notfound.php，同样上传到网站根目录。 2、IIS/.net设置404 首先，修改应用程序根目录的设置，打开 web.config文件编辑，在其中加入如下内容： 注：上文例中error.asp为系统默认的404页面，notfound.asp为自定义的404页面，使用时请修改相应文件名。然后，在自定义的404页面notfound.asp中加入：&lt;% found=”” not=”” response.status=”404”&gt; 。这样，便可以保证IIS能够正确地返回404状态码。 &lt;% found=”” not=”” response.status=”404”&gt; 五、制作设置404错误页面注意事项 1.不要将404错误页面转向到网站主页，否则可能会导致主页在搜索引擎中消失。 2.不要使用绝对URL，如果使用绝对URL返回的状态码是302+200。 3.404错误页面设置完成，一定要检查是否正确。但http头信息返回的一定要是404状态。这主要是对搜索引擎有关系，因为如果你网站产生较多页面时候但搜索引擎看到的是很多一样的正常页面，有可能会误被认为作弊。 4.404错误页面不要自动跳转，让用户来决定去向，对于用户体验很重要。 总结：404错误页面建议1.不使用专业术语。2.不要责备访客。3.提示访客检查拼写。4.让页面返回404。5.明确表明404。6.帮助访客如果浏览。7.放置网站主页链接。8.访客方便反馈信息。9.保持品牌风格。10.让访客搜索想要的。11.修复你的错误链接。12.不要301重定向到主页。","path":"article/0.html","date":"06-03","excerpt":"","tags":[]},{"title":"庆祝绿帽的个人博客","text":"其实这是第一篇文章也没什么要说的呢","path":"article/538b512a.html","date":"06-02","excerpt":"","tags":[]}]}